Revit 2027 API
NurbSpline.CtrlPoints Property
Returns the control points of the nurb spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> CtrlPoints { get; }
Public ReadOnly Property CtrlPoints As IList(Of XYZ)
	Get
public:
property IList<XYZ^>^ CtrlPoints {
	IList<XYZ^>^ get ();
}
member CtrlPoints : IList<XYZ> with get
Property Value
IList<XYZ>
Remarks
 This method returns a copy of the internally-managed data. Repeated access of this property will return a new copy each time, which may be inefficient.
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace